In [1]:
import numpy as np
import pandas as pd

### 1084. Sales Analysis III

Write a solution to report the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

Return the result table in any order.

The result format is in the following example.

In [2]:
data = [[1, 'S8', 1000], [2, 'G4', 800], [3, 'iPhone', 1400]]
product = pd.DataFrame(data, columns=['product_id', 'product_name', 'unit_price']).astype({'product_id':'Int64', 'product_name':'object', 'unit_price':'Int64'})
data = [[1, 1, 1, '2019-01-21', 2, 2000], [1, 2, 2, '2019-02-17', 1, 800], [2, 2, 3, '2019-06-02', 1, 800], [3, 3, 4, '2019-05-13', 2, 2800]]
sales = pd.DataFrame(data, columns=['seller_id', 'product_id', 'buyer_id', 'sale_date', 'quantity', 'price']).astype({'seller_id':'Int64', 'product_id':'Int64', 'buyer_id':'Int64', 'sale_date':'datetime64[ns]', 'quantity':'Int64', 'price':'Int64'})
display(product)
display(sales)

   product_id product_name  unit_price
0           1           S8        1000
1           2           G4         800
2           3       iPhone        1400

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800
2          2           2         3 2019-06-02         1    800
3          3           3         4 2019-05-13         2   2800

In [7]:
sales[(sales['sale_date'] >= '2019-01-01') & (sales['sale_date'] <= '2019-03-31')]

   seller_id  product_id  buyer_id  sale_date  quantity  price
0          1           1         1 2019-01-21         2   2000
1          1           2         2 2019-02-17         1    800

In [15]:
sales.groupby(['sale_date','product_id']).count()

                       seller_id  buyer_id  quantity  price
sale_date  product_id
2019-01-21 1                   1         1         1      1
2019-02-17 2                   1         1         1      1
2019-05-13 3                   1         1         1      1
2019-06-02 2                   1         1         1      1

In [27]:
new = pd.merge(left=product, right=sales, on='product_id')
product_date = new.groupby(['product_id'])['sale_date'].unique()
product_date

product_id
1                         [2019-01-21 00:00:00]
2    [2019-02-17 00:00:00, 2019-06-02 00:00:00]
3                         [2019-05-13 00:00:00]
Name: sale_date, dtype: object

In [33]:
product_date

product_id
1                         [2019-01-21 00:00:00]
2    [2019-02-17 00:00:00, 2019-06-02 00:00:00]
3                         [2019-05-13 00:00:00]
Name: sale_date, dtype: object

In [20]:
new

,product_id,product_name,unit_price,seller_id,buyer_id,sale_date,quantity,price
0,1,S8,1000,1,1,2019-01-21,2,2000
1,2,G4,800,1,2,2019-02-17,1,800
2,2,G4,800,2,3,2019-06-02,1,800
3,3,iPhone,1400,3,4,2019-05-13,2,2800